{"backend": "tensorflow", "keras_version": "2.2.0", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32", "name": "input_1"}}, {"name": "conv1_pad", "class_name": "ZeroPadding2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "name": "conv1_pad", "trainable": true, "padding": [[3, 3], [3, 3]]}}, {"name": "conv1", "class_name": "Conv2D", "inbound_nodes": [[["conv1_pad", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "conv1", "use_bias": true, "bias_constraint": null, "kernel_size": [7, 7], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [2, 2], "activity_regularizer": null}}, {"name": "bn_conv1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"name": "bn_conv1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"data_format": "channels_last", "trainable": true, "name": "max_pooling2d_1", "padding": "valid", "strides": [2, 2], "pool_size": [3, 3]}}, {"name": "res2a_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res2a_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2a_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"name": "bn2a_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"name": "res2a_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res2a_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2a_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"name": "bn2a_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"name": "res2a_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res2a_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "res2a_branch1", "class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res2a_branch1", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2a_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"name": "bn2a_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "bn2a_branch1", "class_name": "BatchNormalization", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"name": "bn2a_branch1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_1", "class_name": "Add", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": true}}, {"name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"name": "res2b_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res2b_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2b_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"name": "bn2b_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"name": "res2b_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res2b_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2b_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"name": "bn2b_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"name": "res2b_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res2b_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2b_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"name": "bn2b_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_2", "class_name": "Add", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "add_2", "trainable": true}}, {"name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"name": "res2c_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res2c_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2c_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"name": "bn2c_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"name": "res2c_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res2c_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 64, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2c_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"name": "bn2c_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_9", "class_name": "Activation", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"name": "res2c_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res2c_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn2c_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"name": "bn2c_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_3", "class_name": "Add", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_3", "trainable": true}}, {"name": "activation_10", "class_name": "Activation", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": true, "activation": "relu"}}, {"name": "res3a_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3a_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "strides": [2, 2], "activity_regularizer": null}}, {"name": "bn3a_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "config": {"name": "bn3a_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_11", "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": true, "activation": "relu"}}, {"name": "res3a_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res3a_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3a_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "config": {"name": "bn3a_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_12", "class_name": "Activation", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": true, "activation": "relu"}}, {"name": "res3a_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3a_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "activity_regularizer": null}}, {"name": "res3a_branch1", "class_name": "Conv2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3a_branch1", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "strides": [2, 2], "activity_regularizer": null}}, {"name": "bn3a_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "config": {"name": "bn3a_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "bn3a_branch1", "class_name": "BatchNormalization", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "config": {"name": "bn3a_branch1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_4", "class_name": "Add", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "config": {"name": "add_4", "trainable": true}}, {"name": "activation_13", "class_name": "Activation", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": true, "activation": "relu"}}, {"name": "res3b_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3b_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3b_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "config": {"name": "bn3b_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_14", "class_name": "Activation", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": true, "activation": "relu"}}, {"name": "res3b_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res3b_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3b_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "config": {"name": "bn3b_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_15", "class_name": "Activation", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": true, "activation": "relu"}}, {"name": "res3b_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3b_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3b_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "config": {"name": "bn3b_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_5", "class_name": "Add", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "config": {"name": "add_5", "trainable": true}}, {"name": "activation_16", "class_name": "Activation", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_16", "trainable": true, "activation": "relu"}}, {"name": "res3c_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3c_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3c_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "config": {"name": "bn3c_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_17", "class_name": "Activation", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "config": {"name": "activation_17", "trainable": true, "activation": "relu"}}, {"name": "res3c_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res3c_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3c_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "config": {"name": "bn3c_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_18", "class_name": "Activation", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "config": {"name": "activation_18", "trainable": true, "activation": "relu"}}, {"name": "res3c_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3c_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3c_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "config": {"name": "bn3c_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_6", "class_name": "Add", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "config": {"name": "add_6", "trainable": true}}, {"name": "activation_19", "class_name": "Activation", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_19", "trainable": true, "activation": "relu"}}, {"name": "res3d_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3d_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3d_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "config": {"name": "bn3d_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_20", "class_name": "Activation", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "config": {"name": "activation_20", "trainable": true, "activation": "relu"}}, {"name": "res3d_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res3d_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 128, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3d_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "config": {"name": "bn3d_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_21", "class_name": "Activation", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "config": {"name": "activation_21", "trainable": true, "activation": "relu"}}, {"name": "res3d_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res3d_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 512, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn3d_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "config": {"name": "bn3d_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_7", "class_name": "Add", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "add_7", "trainable": true}}, {"name": "activation_22", "class_name": "Activation", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_22", "trainable": true, "activation": "relu"}}, {"name": "res4a_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res4a_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [2, 2], "activity_regularizer": null}}, {"name": "bn4a_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "config": {"name": "bn4a_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_23", "class_name": "Activation", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "config": {"name": "activation_23", "trainable": true, "activation": "relu"}}, {"name": "res4a_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res4a_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn4a_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "config": {"name": "bn4a_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_24", "class_name": "Activation", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "config": {"name": "activation_24", "trainable": true, "activation": "relu"}}, {"name": "res4a_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res4a_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 1024, "strides": [1, 1], "activity_regularizer": null}}, {"name": "res4a_branch1", "class_name": "Conv2D", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res4a_branch1", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 1024, "strides": [2, 2], "activity_regularizer": null}}, {"name": "bn4a_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "config": {"name": "bn4a_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "bn4a_branch1", "class_name": "BatchNormalization", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "config": {"name": "bn4a_branch1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_8", "class_name": "Add", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "config": {"name": "add_8", "trainable": true}}, {"name": "activation_25", "class_name": "Activation", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_25", "trainable": true, "activation": "relu"}}, {"name": "res4b_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res4b_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn4b_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "config": {"name": "bn4b_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_26", "class_name": "Activation", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "config": {"name": "activation_26", "trainable": true, "activation": "relu"}}, {"name": "res4b_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res4b_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn4b_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "config": {"name": "bn4b_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_27", "class_name": "Activation", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "config": {"name": "activation_27", "trainable": true, "activation": "relu"}}, {"name": "res4b_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res4b_branch2c", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 1024, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn4b_branch2c", "class_name": "BatchNormalization", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "config": {"name": "bn4b_branch2c", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "add_9", "class_name": "Add", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "config": {"name": "add_9", "trainable": true}}, {"name": "activation_28", "class_name": "Activation", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_28", "trainable": true, "activation": "relu"}}, {"name": "res4c_branch2a", "class_name": "Conv2D", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "valid", "name": "res4c_branch2a", "use_bias": true, "bias_constraint": null, "kernel_size": [1, 1], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn4c_branch2a", "class_name": "BatchNormalization", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "config": {"name": "bn4c_branch2a", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_29", "class_name": "Activation", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "config": {"name": "activation_29", "trainable": true, "activation": "relu"}}, {"name": "res4c_branch2b", "class_name": "Conv2D", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "padding": "same", "name": "res4c_branch2b", "use_bias": true, "bias_constraint": null, "kernel_size": [3, 3], "trainable": true, "activation": "linear", "kernel_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "filters": 256, "strides": [1, 1], "activity_regularizer": null}}, {"name": "bn4c_branch2b", "class_name": "BatchNormalization", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "config": {"name": "bn4c_branch2b", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null, "scale": true, "center": true, "gamma_constraint": null, "momentum": 0.99, "trainable": true, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "axis": 3}}, {"name": "activation_30", "class_name": "Activation", "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "config": {"name": "activation_30", "trainable": true, "activation": "relu"}}, {"name": "res4c_branch2c", "class_name": "Conv2D", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": 